package games

var (
	Time = [][]int{{1, 5, 10, 15, 18, 20, 21, 25, 27, 30}, {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11},
		{1, 2, 3, 5, 7, 10, 12, 15, 20, 27, 40, 69, 100, 999}}

	// Bunker data

	IsOrIsnt = []string{"є", "немає", "немає", "немає"}
	Square   = []int{11, 20, 35, 49, 60, 87, 100, 121, 156, 203, 270, 340, 500}

	AdditionalItems = []string{" працюючі комп'ютери", " генератор та бочка пального", " зламаний генератор", " 2 аптечки",
		" інструкція з виживання у лісі", " гідрокостюм та балон з повітрям", " підготовлена операційна",
		" самогонний апарат", " замаскована труба для нагляду за поверхнею", " підвал із вином", " набір інструментів",
		" майстерні з інструментами", " зимовий одяг", " радіо", " спортзал", " насіння редьки", " робочий холодильник",
		" спрей від комах", " набір ножів", " пістолет із патронами", " карти уно", " працюючий телефон", " купу коробок",
		" вогнегасники", " набір для виживання", " хоробрий алабай", " 4 рації", " кілька сонячних батарей",
		" насіння огірків", " рушницю та 30 набоїв", " компас з місцевою картою", " ліхтарики", " труби для сантехніки",
		" інкубатор з яйцями", " коробка із протигазами від радіації", " насіння пшениці та пакет ґрунту",
		" лічильник Гейгера", " антидот"}

	// Catastrophe data

	SurvivePopulation = []float32{0.01, 0.1, 1, 2, 3, 5, 7, 10, 15, 30, 50, 80, 90, 99}
	DestructionDegree = []int{1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25,
		26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53,
		54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81,
		82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100}

	Catastrophes = []string{
		"<b>Напад інопланетян</b>\nІнопланетна раса вирішила захопити Землю. Міжпланетні апарати падають на поверхню планети" +
			" один за одним Зброя військових виявляється безсилою проти них і поступово прибульці винищують частину населення." +
			" Після виходу з бункера переважна більшість інопланетян загинула через непристосованість до мікроорганізмів Землі.",
		"<b>Метеорит</b>\nНа планету падає космічний об'єкт величезних розмірів створюючи потужну ударну хвилю яка зносить все" +
			" на своєму шляху. На місці падіння утворюється масштабний кратер. Повсюди проходять сильні землетруси і цунамі.",
		"<b>Екологічна катастрофа та глобальний голод</b>\nІнтенсивне ведення сільського господарства та деградація ґрунтів" +
			" разом із посухою призвели до піщаних бурь, які масово знищують посіви та призводять до неврожаю та значного зменшення" +
			" запасів їжі. Концентрація кисню в атмосфері падає і клімат значно погіршується.",
		"<b>Сіміанський грип</b>\nСтворений вченими штам ліків від хвороби Альцгеймера в результаті став смертельним для людей," +
			" що призвело до пандемії сіміанського грипу і сходу еволюціонованих мавп. У всіх людей, що залишилися, є імунітет до вірусу," +
			" але він здатний мутувати. Більшість мавп налаштовані вороже по відношенню до людей.",
		"<b>Хімічна війна</b>\nВнаслідок застосування хімічної та бактеріологічної зброї було порушено мікробіологічний склад ґрунтів," +
			" значно змінився екологічний баланс рослин, ґрунт і вода були отруєні. На Землі залишився малий відсоток живих істот, що населяють її.",
		"<b>Глобальний потоп</b>\nЧерез діяльність людини всі полярні сніги розтанули, покривши всю Землю водою. Клімат серйозно" +
			" порушився, тропіки тепер усюди. З'явилися нові види рослин і комах великих розмірів.",
		"<b>Біотероризм</b>\nСтворюючи більш заразний і смертоносний штам вірусу в стінах дослідницької лабораторій один із працівників" +
			" випадково їм заразився, внаслідок чого вірус вийшов з-під контролю і дуже швидко поширився по всій планеті." +
			"В інших істот і рослин розвинулися мутації.",
		"<b>Супервулкан</b>\nВибух Єллоустонського супервулкану похитнув Землю. Викинутий в атмосферу попіл закрив Сонце на кілька місяців." +
			" На планеті почалася \"ядерна зима\". Середня температура опустилася на 11 градусів. На планеті тепер панує глобальна посуха.",
		"<b>Суперкомп'ютер</b>\nШтучний інтелект, створений для управління системами оборони, вийшов з ладу і почав вважати людство" +
			" великою небезпекою. Це призвело до того, що штучний інтелект відключив інструкцію \"не вбивати людину\" і взяв" +
			" під контроль процедури управління військовими роботами, які почали винищувати людство. Суперкомп'ютер захопив владу над планетою.",
		"<b>Зомбі-апокаліпсис</b>\nНевідомий збудник став причиною перетворення людей на кровожерливих зомбі. Лікарні більше не функціонують." +
			" Тотальна паніка. Армія починає стріляти по людях при спробі залишити карантинну зону. Влада вже не може " +
			"контролювати ситуацію. Починається тотальне мародерство і анархія. Після виходу з бункера малий відсоток зомбі залишиться живим.",
		"<b>Прорив зони 51</b>\nІстоти, що знаходились в цій зоні вийшли назовні і тепер знищують всю землю.",
		"<b>Ядерна війна</b>\nКілька протиборчих сторін одночасно запустили один на одного залп ядерних боєголовок. " +
			"Після вибухів загинула велика кількість людей і почались величезні пожежі. Усю планету огорнув ядерний пил," +
			" що закрив сонячне світло і призвів до довгої ядерної зими. Спостерігаються проблеми з грунтом, водою і" +
			" рослинністю. На поверхні потрібна хімічна обробка, тварини мутували.",
		"<b>Чорна смерть</b>\nРозкопки середньовічних поховань призвели до нового зараження чумою, яка сколихнула весь світ.",
		"<b>Страшний вірус</b>\nВчені намагалися дістати з дна одного і водемів Антарктиди новий вид бактерій, але здобули страшний вірус," +
			" який має надмірну смертоносність та заразність.",
		"<b>Радісне сонечко</b>\nЧерез порушення термоядерних процесів на сонці температура атмосфери землі значно збільшилася." +
			" Рослини загинули, річки та озера пересохли і людям довелося оселитися під землею, де взимку і влітку одна і та ж температура. " +
			"Вчені припускають, що через декілька років сонце \"охолоне\" до нормальної температури.",
	}

	// Character data

	Gender = []string{"чоловік", "жінка"}
	Age    = []int{18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40,
		41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 59, 61, 62, 63, 65,
		66, 67, 68, 70, 71, 73, 75, 77, 80, 90, 100}

	Profession = []string{"автомеханік", "агент ФБР", "агент ЦРУ", "агроном", "адвокат", "актор", "акушер-гінеколог",
		"альпініст", "археолог", "архітектор", "астролог", "астронавт", "астроном", "банкір", "баріста", "бармен",
		"бібліотекар", "бізнесмен", "біолог", "блогер", "боєць спецназу", "боксер", "бортпровідник", "ботанік",
		"браконьєр", "бурильник", "бухгалтер", "ветеринар", "візажист", "вірусолог", "військовослужбовець", "географ",
		"геолог", "вантажник", "дайвер", "далекобійник", "дегустатор", "депутат", "детектив", "діджей", "дизайнер",
		"дроворуб", "єгер", "журналіст", "імунолог", "інженер", "інструктор із виживання", "інфекціоніст", "картограф",
		"каскадер", "касир", "кілер", "кінолог", "клоун", "композитор", "кондитер", "консультант", "косметолог",
		"криміналіст", "критик", "ліфтер", "маркетолог", "машиніст", "модель", "м'ясник", "окуліст", "онколог",
		"офіціант", "охоронець", "перукар", "пастух", "патологоанатом", "співак", "перекладач", "пілот", "письменник",
		"тесляр", "кухар", "пожежний", "політолог", "поліцейський", "порноактор", "кравець", "листоноша", "президент",
		"програміст", "продавець морозива", "прокурор", "психолог", "психотерапевт", "бджоляр", "радист", "різноробочий",
		"редактор", "режисер", "рибалка", "садівник", "сантехнік", "зварювальник", "священик", "секретар", "сексолог",
		"скульптор", "слюсар", "соціолог", "рятувальник", "стоматолог", "стрімер", "будівельник", "суддя",
		"татуювальник", "телеведучий", "охоронець", "тренер з фізичної культури", "прибиральник", "уролог",
		"вчитель молодших класів", "вчений", "фармацевт", "фельдшер", "фермер", "фізик ядерщик", "фізик", "філософ",
		"фотограф", "футболіст", "хімік", "хірург", "хірург", "хірург", "художник", "шахтар", "еколог", "електрик", "юрист"}
	ProfessionExp     = []int{1, 2, 3, 5, 7, 8, 10, 12, 15, 18, 20, 23, 26, 31}
	ProfessionExpDate = []string{" місяць(-ів)", " років"}

	HealthStatus = []string{"ВІЛ", "авітаміноз", "алкоголізм", "алергія на тварин", "алергія на пил", "астма",
		"безсоння", "біполярний розлад", "хвороба Альцгеймера", "вітрянка", "гайморит", "гастрит", "гемофілія",
		"гепатит В", "глаукома", "дальтонізм", "депресія", "діарея", "заїкуватість", "карієс",
		"косоокість", "міжхребцева грижа", "мігрень", "сечокам'яна хвороба", "наркоманія", "нетримання сечі",
		"остеохондроз", "параноя", "плоскостопість", "пневмонія", "застуда",
		"псоріаз", "пташиний грип", "рак крові", "рак легенів", "цукровий діабет другого типу",
		"цукровий діабет першого типу", "синдром Туретта", "поганий зір", "туберкульоз", "розумова відсталість", "цинга",
		"шизофренія", "епілепсія", "виразка шлунку", "глухонімота", "відсутність ноги", "відсутність руки", "сліпота"}
	IllnessStage = []int{10, 20, 30, 40, 50, 60, 70, 80, 85, 90, 95, 99}

	Fertility = []string{"безплідність", "чайлдфрі", "плодовитий(-а)", "так", "дуже плодовитий(-а)"}
	BodyType  = []string{"анорексія", "худощавий", "нормальний", "атлетичний", "худощавий", "нормальний", "атлетичний",
		"є зайва вага", "ожиріння ІІ ступеня", "ожиріння ІІІ ступеня"}

	Phobia = []string{"страх павуків", "страх замкнутого простору", "страх темряви",
		"страх висоти", "страх страху", "страх крові", "страх потонути", "страх відкритого простору",
		"страх гострих предметів", "страх гучних звуків", "страх прийняття рішень", "страх собак", "страх комп'ютера",
		"страх дітей", "страх спати", "страх гризунів",
		"страх тарганів", "страх плазунів", "страх зброї", "страх потоплення", "страх комах", "страх клоунів",
		"страх зараження", "страх птахів", "страх вогню", "страх холоду", "страх радіації", "страх смерті",
		"страх приймати ліки", "страх лікарів", "страх жінок", "страх чоловіків"}
	Hobby = []string{"ведення блогу", "волонтерство", "вирощування рослин", "вишивання", "заняття бойовими мистецтвами",
		"фітнес", "гра у страйкбол", "гра у футбол", "гра на гітарі", "гра на піаніно", "вивчення мов", "колекціонування монет",
		"кулінарія", "ліпка із глини", "метання списа", "метання ножів", "полювання", "спів", "пивоваріння", "підводне плавання",
		"походи", "перегляд аніме", "проходження комп'ютерних ігор", "бджільництво", "робота із металом", "радіоаматорство",
		"різьба по дереву", "вирішення головоломок", "малювання", "риболовля", "збирання грибів", "скелелазіння",
		"створення фігурок орігамі", "створення фокусів", "стрільба з лука", "серфінг", "танці", "туризм", "фехтування"}

	AdditionalInfo = []string{"був(ла) вожатим у таборі", "веде особистий щоденник", "вірить у прибульців",
		"вірить у надприродних істот", "має гарну спортивну підготовку", "виграв(ла) у лотереї", "посів(ла) перше місце на марафоні",
		"знає чотири мови", "грав у театрі", "має дві вищі освіти", "має екстрасенсорні здібності", "любить м'які іграшки",
		"може надати першу допомогу", "ненавидить каву", "ненавидить музику", "не терпить алкоголь",
		"має феноменальну пам'ять", "пограбував(ла) банк", "пережив(ла) три замахи", "побував у вісімнадцяти країнах",
		"побував на вершині Евересту", "за першою освітою – терапевт", "поставив світовий рекорд з поїдання бургерів",
		"продав нирку", "проектував цей бункер", "проходив(a) курс з самооборони", "проходив(а) курси кулінарії",
		"проходив курси масажу", "проходив(а) курси перукаря", "проходив(а) курси психолога", "сидів у в'язниці",
		"рятував потопаючого", "страждає на морську хворобу", "впевнений(а), що живе у матриці", "захоплюється тваринництвом",
		"захоплюється полюванням", "вміє розкривати замки", "вміє жонглювати", "вміє орієнтуватися за зірками",
		"добре знає вищу математику", "добре грає в карти", "добре ладнає з тваринами", "добре орієнтується на місцевосці",
		"читав книгу про виживання на безлюдному острові", "є вегетеріанцем", "є майстром спорту з боксу"}

	Baggage = []string{"аптечка", "бездротової колонки", "бладхаунд", "пляшка шампанського", "гайковий ключ", "газова лампа",
		"гітара", "немовля", "губна гармошка", "дідова рушниця", "десять одноразових медичних масок", "щоденник того, хто вижив",
		"запальничка", "кишеньковий годинник", "карта місцевості", "касети з фільмами", "книга з соціології", "компас",
		"консерви", "коробки з боєприпасами", "коробка сірників", "льодоруб та трос", "лійка", "лук і стріли",
		"молоток та цвяхи", "набір для шиття", "набір інструментів", "набір кухонних інструментів", "настільні ігри",
		"німецька вівчарка", "кілька чистих аркушів пергаменту", "ноутбук", "відкривачка", "пачка цигарок", "персидський кіт",
		"пневматичний пістолет", "протигаз", "радіо", "рулони туалетного паперу", "насіння капусти", "насіння картоплі",
		"насіння пшениці", "стільниковий телефон", "стерильні одноразові шприци", "журнали для дорослих", "телевізор",
		"сокира і мотузка", "три респіраторні маски", "флейта", "ліхтарик та запасні батарейки", "фотоапарат", "чотири рації"}

	Cards = []string{
		"Згенерувати новий стан здоров'я", "Ви не зможете потрапити в бункер, якщо гравець справа пройде в бункер",
		"Ви зможете пройти в бункер, якщо гравець зліва пройде в бункер", "Ви зможете пройти в бункер, якщо гравець справа пройде в бункер",
		"Ви не зможете потрапити в бункер, якщо гравець справа пройде в бункер", "Обмінятися хобі з іншим гравцем",
		"Змінити місцями багаж двох інших гравців", "Перегенеруйте будь-яку вашу характеристику", "Перегенеруйте професії всіх гравців",
		"Ви знаєте де знаходиться інший ворожий бункер", "Ви знаєте де інший дружній бункер", "Ви знаєте де знаходиться склад зі зброєю",
		"Ви знаєте де знаходиться торговий центр", "Біля вашого бункера є 2 чоловіки(характеристики невідомі)",
		"Біля вашого бункера є 2 жінки(характеристики невідомі)", "Біля вашого бункера знаходяться 4 здорові жінки до 40 років",
		"Біля вашого бункера знаходяться 4 здорові чоловіки до 50 років", "Розкрийте всі характеристики одного гравця",
		"Обмінятися багажем з іншим гравцем", "+1 слот у бункері", "-1 слот у бункері", "+1 слот у бункері", "-1 слот у бункері",
		"У вашому багажі з'являється ще один предмет", "Ви анулюєте всі голоси за якогось гравця, крім себе",
		"Ваш бункер знаходиться біля ворожого бункера", "Змінити свою професію", "Змінити професію будь-якого гравця, крім себе",
		"Вилікувати будь-якого гравця, враховуючи себе", "Ви потрапите в інший бункер і зможете помститися бункеру, в який не змогли потрапити",
		"Змінити свій стан здоров'я та здатність до запліднення на новий", "Вилікувати себе від будь-якої недуги",
		"Вилікувати свою фобію", "Змінити \"стан здоров'я\" на новий", "Змінити професію на нову",
		"Ви знаєте де знаходиться бункер в якому одні жінки(здорові, вік до 30)", "Ви знаєте де знаходиться бункер з 2 медичними співробітниками",
		"Можливість вилікувати безпліддя у будь-якого чоловіка", "Ви знаєте де зберігся погріб з вином", "Ви знаєте де знаходиться склад зі зброєю",
		"Можливість помінятися будь-якою характеристикою з будь-ким", "Перегенерувати 2 ваші карти", "Згенерувати собі ще одну професію",
		"Розкрити будь-яку характеристику будь-якого гравця", "Розкрити будь-яку характеристику будь-якого гравця", "Скасування всіх професій",
	}
)
