package games

var (
	// Bunker data

	IsOrIsnt = []string{"є", "немає"}
	Square   = []int{20, 35, 49, 60, 87, 100, 121, 156, 203, 270, 340, 500}
	Time     = [][]int{{1, 5, 10, 15, 18, 20, 21, 25, 27, 30}, {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11},
		{1, 2, 3, 5, 7, 10, 12, 15, 20, 27, 40, 69, 100, 999}}

	AdditionalItems = []string{" працюючі комп'ютери", " генератор та бочка пального", " зламаний генератор", " 2 аптечки",
		" інструкція з виживання у лісі", " гідрокостюм та балон з повітрям", " підготовлена операційна",
		" самогонний апарат", " замаскована труба для нагляду за поверхнею", " підвал із вином", " набір інструментів",
		" майстерні з інструментами", " зимовий одяг", " радіо", " спортзал", " насіння редьки", " робочий холодильник",
		" спрей від комах", " набір ножів", " пістолет із патронами", " карти уно", " працюючий телефон", " купу коробок",
		" вогнегасники", " набір для виживання", " хоробрий алабай", " 4 рації", " кілька сонячних батарей",
		" насіння огірків", " рушницю та 30 набоїв", " компас з місцевою картою", " ліхтарики", " труби для сантехніки",
		" інкубатор з яйцями", " коробка із протигазами від радіації", " насіння пшениці та пакет ґрунту",
		" лічильник Гейгера", " антидот"}

	// Character data

	Gender = []string{"чоловік", "жінка"}
	Age    = []int{18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40,
		41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 59, 60, 61, 62, 63, 64, 65,
		66, 67, 68, 70, 71, 73, 75, 77, 79, 80, 90, 100}

	Profession = []string{"автомеханік", "агент ФБР", "агент ЦРУ", "агроном", "адвокат", "актор", "акушер-гінеколог",
		"альпініст", "археолог", "архітектор", "астролог", "астронавт", "астроном", "банкір", "баріста", "бармен",
		"бібліотекар", "бізнесмен", "біолог", "блогер", "боєць спецназу", "боксер", "бортпровідник", "ботанік",
		"браконьєр", "бурильник", "бухгалтер", "ветеринар", "візажист", "вірусолог", "військовослужбовець", "географ",
		"геолог", "вантажник", "дайвер", "далекобійник", "дегустатор", "депутат", "детектив", "діджей", "дизайнер",
		"дроворуб", "єгер", "журналіст", "імунолог", "інженер", "інструктор із виживання", "інфекціоніст", "картограф",
		"каскадер", "касир", "кілер", "кінолог", "клоун", "композитор", "кондитер", "консультант", "косметолог",
		"криміналіст", "критик", "ліфтер", "маркетолог", "машиніст", "модель", "м'ясник", "окуліст", "онколог",
		"офіціант", "охоронець", "перукар", "пастух", "патологоанатом", "співак", "перекладач", "пілот", "письменник",
		"тесляр", "кухар", "пожежний", "політолог", "поліцейський", "порноактор", "кравець", "листоноша", "президент",
		"програміст", "продавець морозива", "прокурор", "психолог", "психотерапевт", "бджоляр", "радист", "різноробочий",
		"редактор", "режисер", "рибалка", "садівник", "сантехнік", "зварювальник", "священик", "секретар", "сексолог",
		"скульптор", "слюсар", "соціолог", "рятувальник", "стоматолог", "стрімер", "будівельник", "суддя",
		"татуювальник", "телеведучий", "охоронець", "тренер з фізичної культури", "прибиральник", "уролог",
		"вчитель молодших класів", "вчений", "фармацевт", "фельдшер", "фермер", "фізик ядерщик", "фізик", "філософ",
		"фотограф", "футболіст", "хімік", "хірург", "хірург", "хірург", "художник", "шахтар", "еколог", "електрик", "юрист"}
	ProfessionExp     = []int{1, 2, 3, 5, 7, 8, 10, 12, 15, 18, 20, 23, 26, 31}
	ProfessionExpDate = []string{" місяць(-ів)", " років"}

	HealthStatus = []string{"ВІЛ", "авітаміноз", "алкоголізм", "алергія на тварин", "алергія на пил", "астма",
		"безсоння", "біполярний розлад", "хвороба Альцгеймера", "вітрянка", "гайморит", "гастрит", "гемофілія",
		"гепатит В", "глаукома", "дальтонізм", "депресія", "діарея", "заїкуватість", "карієс",
		"косоокість", "міжхребцева грижа", "мігрень", "сечокам'яна хвороба", "наркоманія", "нетримання сечі",
		"остеохондроз", "параноя", "плоскостопість", "пневмонія", "застуда",
		"псоріаз", "пташиний грип", "рак крові", "рак легенів", "цукровий діабет другого типу",
		"цукровий діабет першого типу", "синдром Туретта", "поганий зір", "туберкульоз", "розумова відсталість", "цинга",
		"шизофренія", "епілепсія", "виразка шлунку", "глухонімота", "відсутність ноги", "відсутність руки", "сліпота"}
	IllnessStage = []int{10, 20, 30, 40, 50, 60, 70, 80, 85, 90, 95, 99}

	Fertility = []string{"безплідність", "чайлдфрі", "плодовитий(-а)", "плодовитий(-а)", "дуже плодовитий(-а)"}
	BodyType  = []string{"анорексія", "худощавий", "нормальний", "атлетичний", "худощавий", "нормальний", "атлетичний",
		"є зайва вага", "ожиріння ІІ ступеня", "ожиріння ІІІ ступеня"}

	Phobia = []string{"страх павуків", "страх замкнутого простору", "страх темряви",
		"страх висоти", "страх страху", "страх крові", "страх потонути", "страх відкритого простору",
		"страх гострих предметів", "страх гучних звуків", "страх прийняття рішень", "страх собак", "страх комп'ютера",
		"страх дітей", "страх спати", "страх гризунів",
		"страх тарганів", "страх плазунів", "страх зброї", "страх потоплення", "страх комах", "страх клоунів",
		"страх зараження", "страх птахів", "страх вогню", "страх холоду", "страх радіації", "страх смерті",
		"страх приймати ліки", "страх лікарів"}
	Hobby = []string{"ведення блогу", "волонтерство", "вирощування рослин", "вишивання", "заняття бойовими мистецтвами",
		"фітнес", "гра у страйкбол", "гра у футбол", "гра на гітарі", "гра на піаніно", "вивчення мов", "колекціонування монет",
		"кулінарія", "ліпка із глини", "метання списа", "метання ножів", "полювання", "спів", "пивоваріння", "підводне плавання",
		"походи", "перегляд аніме", "проходження комп'ютерних ігор", "бджільництво", "робота із металом", "радіоаматорство",
		"різьба по дереву", "вирішення головоломок", "малювання", "риболовля", "збирання грибів", "скелелазіння",
		"створення фігурок орігамі", "створення фокусів", "стрільба з лука", "серфінг", "танці", "туризм", "фехтування"}

	AdditionalInfo = []string{"був(а) вожатим у таборі", "веде особистий щоденник", "вірить у прибульців",
		"вірить у надприродних істот", "має гарну спортивну підготовку", "виграв(ла) у лотереї", "посів(а) перше місце на марафоні",
		"знає чотири мови", "грав у театрі", "має дві вищі освіти", "має екстрасенсорні здібності", "любить м'які іграшки",
		"може надати першу допомогу", "ненавидить каву", "ненавидить сучасну музику", "не терпить алкоголь",
		"має феноменальну пам'ять", "пограбував(а) банк", "пережив(ла) три замахи", "побував у вісімнадцяти країнах",
		"побував на вершині Евересту", "за першою освітою – терапевт", "поставив світовий рекорд з поїдання бургерів",
		"продав нирку", "проектував цей бункер", "проходив(a) курс з самооборони", "проходив(а) курси кулінарії",
		"проходив курси масажу", "проходив(а) курси перукаря", "проходив(а) курси психолога", "сидів у в'язниці",
		"рятував потопаючого", "страждає на морську хворобу", "впевнений(а), що живе у матриці",
		"впевнений, що ця катастрофа - змова рептилій", "захоплюється тваринництвом", "захоплюється полюванням",
		"вміє розкривати замки", "вміє жонглювати", "вміє орієнтуватися за зірками", "добре знає найвищу математику",
		"добре грає в карти", "добре ладнає з тваринами", "добре орієнтується на місцевосці",
		"читав книгу про виживання на безлюдному острові", "є вегетеріанцем", "є майстром спорту з боксу"}

	Baggage = []string{"аптечка", "бездротової колонки", "бладхаунд", "пляшка шампанського", "гайковий ключ", "газова лампа",
		"гітара", "немовля", "губна гармошка", "дідова рушниця", "десять одноразових медичних масок", "щоденник того, хто вижив",
		"запальничка", "кишеньковий годинник", "карта місцевості", "касети з фільмами", "книга з соціології", "компас",
		"консерви", "коробки з боєприпасами", "коробка сірників", "льодоруб та трос", "лійка", "лук і стріли",
		"молоток та цвяхи", "набір для шиття", "набір інструментів", "набір кухонних інструментів", "настільні ігри",
		"німецька вівчарка", "кілька чистих аркушів пергаменту", "ноутбук", "відкривачка", "пачка цигарок", "персидський кіт",
		"пневматичний пістолет", "протигаз", "радіо", "рулони туалетного паперу", "насіння капусти", "насіння картоплі",
		"насіння пшениці", "стільниковий телефон", "стерильні одноразові шприци", "журнали для дорослих", "телевізор",
		"сокира і мотузка", "три респіраторні маски", "флейта", "ліхтарик та запасні батарейки", "фотоапарат", "чотири рації"}

	Cards = []string{
		"Згенерувати новий стан здоров'я", "Ви не зможете потрапити в бункер, якщо гравець справа пройде в бункер",
		"Ви зможете пройти в бункер, якщо гравець зліва пройде в бункер", "Ви зможете пройти в бункер, якщо гравець справа пройде в бункер",
		"Перегенеруйте бункер", "Можливість вкрасти хобі в іншого гравця", "Змінити місцями багаж двох інших гравців",
		"Перегенеруйте ваше хобі", "Перегенеруйте будь-яку вашу характеристику", "Перегенеруйте хобі всіх гравців",
		"Перегенеруйте професії всіх гравців", "Біля вашого бункера знаходиться інший ворожий бункер",
		"Біля вашого бункера знаходиться інший дружній бункер", "Біля вашого бункера знаходиться склад зі зброєю",
		"Біля вашого бункера знаходиться торговий центр", " Біля вашого бункера є 2 чоловіки (невідомо які у них характеристики)",
		" Біля вашого бункера є 2 жінки (невідомо які у них характеристики)", " Біля вашого бункера знаходяться 4 здорові жінки до 40 років",
		"Біля вашого бункера знаходяться 4 здорові чоловіки до 50 років", " Розкрийте всі характеристики одного гравця",
		" Викрадіть чужий багаж", " +1 слот у бункері", " -1 слот у бункері", "У вашому багажі з'являється ще один предмет",
		" Ви анулюєте всі голоси для якогось гравця, крім себе", "Ваш бункер знаходиться біля ворожого бункера, який негативно налаштований на вас",
		" Змінити свою професію", " будь-який 1 голос проти себе", "Змінити професію будь-якого гравця, крім себе",
		"Вилікувати будь-якого гравця від будь-яких недуг, враховуючи себе", "ви потрапляєте в інший бункер і мститимете бункеру в який не змогли потрапити",
		"Змінити свій стан здоров'я та здатність до запліднення на новий", " Дана карта дає можливість вилікувати тебе від будь-якої недуги",
		" Біля вас знаходиться бункер в якому одні чоловіки (здорові вік до 30 років)", " Дана карта дає можливість вилікувати твою фобію",
		" Ти можеш поміняти свою карту \"стан здоров'я\" на нову", " Ти можеш поміняти свою карту професії на нову",
		" Всі гравці змінюються картами \"професія\" за годинниковою стрілкою", " можливість змінити свою карту стану здоров'я на нову",
		" Біля вас знаходиться бункер в якому одні жінки (здорові вік до 30)", " Поряд з вами другий бункер і він налаштований не доброзичливо",
		" Ви знаєте що поряд бункер де знаходиться 2 медичних співробітника", " Дана карта лікує безпліддя у чоловіка",
		" Ти можеш поміняти свою карту додаткової інформації", "Ви знаєте що в 20 метрах від вашого бункера зберігся погріб з вином",
		"Ви знаєте що в 30 метрах від вашого бункера склад зі зброєю", " можливість помінятися будь-якою характеристикою з будь-ким",
		" ви можете перегенерувати ваші 2 карти", " ви можете перегенерувати 2 карти іншої людини", "перегенеруйте тип тіла всіх гравців",
		"згенеруйте собі ще одну професію",
	}
)
