package settings

// All bot text
var (
	StartMsg       = "👋 Привіт 🕹 Обирай гру:"
	UnknownCommand = "Невідома команда 😕"
	SelectGame     = "🕹 Обери гру:"
	Return         = "⬅️ Назад"

	TheRescue = "\U0001F9BA Порятунок"
	Bunker    = "☢️ Бункер"
	Mafia     = "🎩 Мафія"

	// Bunker

	BunkerOptions     = "🎲 Обери що саме хочеш згенерувати:"
	BunkerCharacter   = "🚻 Персонаж"
	BunkerCatastrophe = "☄️ Катастрофа"
	BunkerShelter     = "⛺️ Інформація про бункер"

	Regenerate = "Перегенерувати 🔄"
	Save       = "Зберегти ⏸"
)
